# 2차원 배열 순회
# 손으로 직접 r, c 값을 추적하기
# """바깥쪽 for문이 천천히 돌고, 안쪽이 빨리 돈다"""

arr = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9],
]
N = 3  # 행 길이
M = 3  # 열 길이

# ---------------------------------------------------------
# 1. 행 우선 순회 (Row-major)
# ---------------------------------------------------------
print('=== 행 우선 순회 ===')
# [실습 1] 행(Row)을 우선으로 순회하는 2중 for문을 작성하세요.
for r in range(N):
    for c in range(M):  # M == len(N)
        # [0][0] [0][1] [0][2] [1][0] [1][1] [1][2] [2][0] [2][1] [2][2]
        print(arr[r][c], end=' ')
print()


# ---------------------------------------------------------
# 2. 열 우선 순회 (Column-major)
# -------------- -------------------------------------------
print('\n=== 열 우선 순회 ===')
# [실습 2] 열(Column)을 우선으로 순회하는 2중 for문을 작성하세요.
for c in range(M):
    for r in range(N):
        # [0][0] [1][0] [2][0] [0][1] [1][1] [2][1] [0][2] [1][2] [2][2]
        print(arr[r][c], end=' ')
print()


# ---------------------------------------------------------
# 3. 지그재그 순회 (Tip)
# ---------------------------------------------------------
print('\n=== 지그재그 순회 ===')
# 짝수 행은 왼쪽->오른쪽, 홀수 행은 오른쪽->왼쪽
# 행 우선 순회
for r in range(N):
    for c in range(M):
        # r이 짝수면 c, 홀수면 M-1-c (역순 인덱스)
        # if의 조건을 바꾸면 지그재그의 방향을 바꿀 수 있음
        if r % 2 == 0:
            current_c = c
        else:
            current_c = M - 1 - c
        # 삼항연산자
        # current_c = c if r % 2 == 0 else M - 1 - c
        print(arr[r][current_c], end=' ')
print()
