'''
다음은 이형기 시인의 "낙화"의 한 구절이다.
- 1연
	가야할 때 언제인가를
	분명히 알고 가는 이의
	뒷모습은 얼마나 아름다운가.

나는 이 시를 보며 '나는 내가 가야할 때가 언제일까?' 를 생각해 보았다.
'''

print('''\
다음은 이형기 시인의 "낙화"의 한 구절이다.
- 1연
\t가야할 때 언제인가를
\t분명히 알고 가는 이의
\t뒷모습은 얼마나 아름다운가.

나는 이 시를 보며 '나는 내가 가야할 때가 언제일까?' 를 생각해 보았다.''')


# TIL 1
# ''' 바로 뒤에 엔터를 치면 첫 줄이 빈 줄로 출력됨
# '''\ 처럼 역슬래시를 붙이면 첫 줄 바꿈을 무시함

# TIL 2
# 마지막 문장이 끝나는 지점에서 바로 '''를 닫으면 입력한 텍스트까지만 출력됨
# 마지막 문장 뒤에 엔터를 치고 '''를 닫으면 빈 줄이 하나 추가됨

# TIL 3
# 따옴표 세 개(''' 또는 """)를 쓴 경우
# 중간에 ' 하나나 " 하나가 나와도 닫는 기호로 인식하지 않음
# 따라서 '나 " 앞에 역슬래시를 쓰지 않아도 됨