############## 주의 ##############
# 입력을 받기위한 input 함수는 절대 사용하지 않습니다.
# math 라이브러리(ceil 등) 사용 금지

def calculate_parking_fee(parking_logs):
    # 여기에 코드를 작성하여 함수를 완성합니다.
    total_fee = []
    for parking_log in parking_logs:
        if parking_log == 0:
            total_fee.append(0)
        elif parking_log <= 30:
            total_fee.append(2000)
        # 최대 금액 10000원이 되는 최소 시간 190분
        # 2000 + (190-30)/10 * 500 = 10000
        elif parking_log < 190:
            # 기본요금은 30분에 2000원이므로 10분 당 500원에 500원이 추가된 값과 같다.
            # 주차시간은 10의 자리에서 올림하므로 몫 나눗셈의 값에 1을 더한다.
            # 그러나 주차시간의 일의 자리가 0인 경우 십의 자리가 올림되지 않이야 하므로 주차시간에 1을 뺀다.
            add_fee = 500 + (((parking_log - 1) // 10) + 1) * 500
            total_fee.append(add_fee)
        else:
            total_fee.append(10000)
    return sum(total_fee)

# 추가 테스트를 위한 코드 작성 가능
# 예) print(함수명(인자))

#####################################################
# 아래 코드를 삭제하는 경우 
# 모든 책임은 삭제한 본인에게 있습니다. 
############## 테스트 코드 삭제 금지 #################
# 1) 25분: 기본 시간 내 -> 2000원
# 2) 45분: 30분(2000) + 15분(10분+5분 -> 2단위 추가) = 2000 + 1000 = 3000원
# 3) 300분: 계산상 금액이 커도 최대 10000원
print(calculate_parking_fee([25, 45, 300])) # 15000
print(calculate_parking_fee([10, 0])) # 2000
#####################################################